lucasbertolossi/F28379D_temp_measurement/ADS124S08.c
//###########################################################################
//
// FILE:   ADS124S08.c
//
// TITLE:  Functions to support ADS124S08EVM using launchpad F28379D
//
// This project should connect F28379D with ADS124S08EVM using SPI and display temperature measured on LCD.
// The connections with the display are presented in F28379D_lcd.h
// The connections with the ADS124S08EVM are presented in ADS124S08.h

// Copyright notice, list of conditions and disclaimer of support library
//###########################################################################
// $TI Release: F2837xD Support Library v3.12.00.00 $
// $Release Date: Fri Feb 12 19:03:23 IST 2021 $
// $Copyright:
// Copyright (C) 2013-2021 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################
/*
 * ADS124S08.c
 *
 *  Created on: 30 de set de 2021
 *      Author: Lucas Bertolossi
 */

/*
 * Software to use ADS124S08EVM with F28379D
 *
 */

#include <stdint.h>
#include "F28x_Project.h"
#include <math.h>
#include "ADS124S08.h"
#include "adchal_tidrivers_adapted.h"
#include "F28379D_lcd.h"
#include <stdio.h>

/* RTD related includes */
#include "inc/rtd.h"
#include "inc/rtd_tables.h"
//#include "device.h"
typedef enum RTDExampleDef{
    RTD_2_Wire_Fig15,     // 2-Wire RTD example using ADS124S08 EVM, User's Guide Figure 15
    RTD_3_Wire_Fig14,     // 3-Wire RTD example using ADS124S08 EVM, User's Guide Figure 14
    RTD_4_Wire_Fig16,     // 4-Wire RTD example using ADS124S08 EVM, User's Guide Figure 16
} RTD_Example;

#define td_CSSC 1   // Delay 1 us first SCLK rising edge after CS falling edge, min 20 ns

//****************************************************************************
//
// Internal variables
//
//****************************************************************************

/* Internal register map array (to recall current configuration) */
static uint16_t registerMap[NUM_REGISTERS];

//****************************************************************************
//
// Functions
//
//****************************************************************************

/************************************************************************************//**
 *
 * @brief getRegisterValue()
 *          Getter function to access the registerMap array outside of this module
 *
 * @param[in]   address The 8-bit register address
 *
 * @return      The 8-bit register value
 */
uint16_t getRegisterValue( uint16_t address )
{
    assert( address < NUM_REGISTERS );
    return registerMap[address];
}


//// Comment if using SPISTEA and not GPIO /CS
//// clearShipSelect - Sets CS Pin to low and delay for a minimum of td(CSSC)
////
void clearChipSelect(void){
    DELAY_US(1);
    GpioDataRegs.GPBCLEAR.bit.GPIO61 = 1;
    DELAY_US(td_CSSC);               // Delays for 1 us (minimum is 20 ns)
}
//
////
//// setChipSelect - Sets CS Pin to high. Performs no waiting.
////
void setChipSelect(void){
    DELAY_US(1);
    GpioDataRegs.GPBSET.bit.GPIO61 = 1;
    DELAY_US(td_CSSC);              // Delays for 1 us (minimum is 20 ns)
}


//uint16_t regWrite(uint16_t regnum, uint16_t data)
void regWrite(uint16_t regnum, uint16_t data)
{
    uint16_t iDataTx[3];
    uint16_t iDataRx[3] = { 0xffff, 0xffff, 0xffff };
    uint16_t i;
    uint16_t junk;
    iDataTx[0] = (0x0000 | (OPCODE_WREG | (regnum & 0x1f)));
    iDataTx[1] = 0x0000;
    iDataTx[2] = data;
    clearChipSelect();
    xferWord(iDataTx[0]);
    xferWord(iDataTx[1]);
    xferWord(iDataTx[2]);
    setChipSelect();
    return;
}



/*
 * Reads a single register contents from the specified address
 *
 * \param regnum identifies which address to read
 *
 */
uint16_t regRead(uint16_t regnum)
{
    uint16_t iDataTx[3];
    uint16_t iDataRx[3] = {0xffff, 0xffff, 0xffff};
    uint16_t i;
    uint16_t junk;
    iDataTx[0] = (0x0000 | (OPCODE_RREG | (regnum & 0x1f)));
    iDataTx[1] = 0x00;
    iDataTx[2] = 0x00;    // clock data into TX buffer to read data

    clearChipSelect();
//    /* MUST MUST MUST purge junk from fifo!!!! */
    while(SpiaRegs.SPIFFRX.bit.RXFFST != 0){
        junk = SpiaRegs.SPIRXBUF;
    }
    junk = SpiaRegs.SPIRXBUF;

    for(i = 0; i < 3; i++){
        SpiaRegs.SPITXBUF = (iDataTx[i] << 8);
        while(SpiaRegs.SPIFFRX.bit.RXFFST !=1) { }
        iDataRx[i] = SpiaRegs.SPIRXBUF;
        }
    setChipSelect();
    return iDataRx[2];
}
////
//// Read the last conversion result
////
//int dataRead(uint32_t *dStatus, uint32_t *dData, uint32_t *dCRC)
//{
//    uint32_t xcrc;
//    uint32_t xstatus;
//    int iData;
//    clearChipSelect();
//    if((registers[SYS_ADDR_MASK] & 0x01) == DATA_MODE_STATUS)
//    {
//        xstatus = xferWord(0x00);
//        dStatus[0] = (uint8_t)xstatus;
//    }
//
//    // get the conversion data
//    iData = xferWord(0x00);
//    iData = (iData<<8) + xferWord(0x00);
//#ifdef ADS124S08
//    iData = (iData<<8) + xferWord(0x00);
//#endif
//    if((registers[SYS_ADDR_MASK] & 0x02) == DATA_MODE_CRC)
//    {
//        xcrc = xferWord(0x00);
//        dCRC[0] = (uint8_t)xcrc;
//    }
//    setChipSelect();
//    return iData ;
//}

void readRTDtemp(void){
    RTD_Set     *rtdSet = NULL;
    RTD_Type    rtdType = Pt;
    RTD_Example rtdExample = RTD_4_Wire_Fig16;
    float       rtdRes, rtdTemp;
    ADCchar_Set adcChars;
    uint16_t     status;
    char errorTimeOut[] = "Timeout on conv.";
    char errorSpiConfig[] = "Error in SPI";
    char* sTemperature;


    switch ( rtdType ) {
        case Pt:
            rtdSet = &PT100_RTD;
            break;
    }

    switch ( rtdExample ) {
//        case RTD_3_Wire_Fig14:
//            adcChars.inputMuxConfReg = RTD_THREE_WIRE_INPUT_MUX;
//            adcChars.pgaReg          = RTD_THREE_WIRE_PGA;
//            adcChars.dataRateReg     = RTD_THREE_WIRE_DATARATE;
//            adcChars.refSelReg       = RTD_THREE_WIRE_REF_SEL;
//            adcChars.IDACmagReg      = RTD_THREE_WIRE_IDACMAG;
//            adcChars.IDACmuxReg      = RTD_THREE_WIRE_IDACMUX;
//            adcChars.Vref            = RTD_THREE_WIRE_EXT_VREF;
//            rtdSet->Rref             = RTD_THREE_WIRE_REF_RES;
//            rtdSet->wiring           = Three_Wire_High_Side_Ref_Two_IDAC;
//            break;
        case RTD_4_Wire_Fig16:
            adcChars.inputMuxConfReg = RTD_FOUR_WIRE_INPUT_MUX;
            adcChars.pgaReg          = RTD_FOUR_WIRE_PGA;
            adcChars.dataRateReg     = RTD_FOUR_WIRE_DATARATE;
            adcChars.refSelReg       = RTD_FOUR_WIRE_REF_SEL;
            adcChars.IDACmagReg      = RTD_FOUR_WIRE_IDACMAG;
            adcChars.IDACmuxReg      = RTD_FOUR_WIRE_IDACMUX;
            adcChars.Vref            = RTD_FOUR_WIRE_INT_VREF;
            rtdSet->Rref             = RTD_FOUR_WIRE_REF_RES;
            rtdSet->wiring           = Four_Wire_High_Side_Ref;
            break;
    }
    adcChars.VBIASReg = RTD_VBIAS;

    if ( !InitADCPeripherals(&adcChars) ) {
        DisplayLCD(1, errorSpiConfig);
//        DisplayLCD(2, "");

        while (1);
    }

    do {
        if ( waitForDRDYHtoL( TIMEOUT_COUNTER ) ) {
            adcChars.adcValue1 = readConvertedData( &status, COMMAND );
            // For 3-wire with one IDAC, multiple readings are needed. So reconfigure ADC to read 2nd channel
//            if ( rtdSet->wiring == Three_Wire_High_Side_Ref_One_IDAC || rtdSet->wiring == Three_Wire_Low_Side_Ref_One_IDAC ) {
//                adcChars2.inputMuxConfReg = RTD_THREE_WIRE_INPUT_MUX2;
//                adcChars2.pgaReg          = RTD_THREE_WIRE_PGA;
//                adcChars2.dataRateReg     = RTD_THREE_WIRE_DATARATE;
//                adcChars2.refSelReg       = RTD_THREE_WIRE_REF_SEL;
//                adcChars2.IDACmagReg      = RTD_THREE_WIRE_IDACMAG;
//                adcChars2.IDACmuxReg      = RTD_THREE_WIRE_IDACMUX;
//                adcChars2.Vref            = RTD_THREE_WIRE_EXT_VREF;
//                adcChars2.VBIASReg        = VBIAS_DEFAULT;
//
//
//                if ( !ReconfigureADC( &adcChars2, spiHdl ) ) {
//                    Display_printf( displayHdl, 0, 0, "Error reconfiguring ADC\n" );
//                    while (1);
//                }
//                // Store second channel value into previous ADC structure as adcValue2
//                if ( waitForDRDYHtoL( TIMEOUT_COUNTER ) ) {
//                   adcChars.adcValue2 = readConvertedData( spiHdl, &status, COMMAND );
//                } else {
//                    Display_printf( displayHdl, 0, 0, "Timeout on conversion\n" );
//                    while (1);
//                }
//            }
            // Convert ADC values RTD resistance
            rtdRes = Convert_Code2RTD_Resistance( &adcChars, rtdSet  );
            // Convert RTD resistance to temperature and linearize
            rtdTemp = RTD_Linearization( rtdSet, rtdRes );
//            Display_printf( displayHdl, 0, 0, "ADC conversion result 1: %i\n", adcChars.adcValue1 );
//            if ( rtdSet->wiring == Three_Wire_High_Side_Ref_One_IDAC || rtdSet->wiring == Three_Wire_Low_Side_Ref_One_IDAC ) {
//                Display_printf( displayHdl, 0, 0, "ADC conversion result 2: %i\n", adcChars.adcValue2 );
//            }

