lucasbertolossi/F28379D_temp_measurement/ADS124S08.c
///************************************************************************************//**
// *
// * @brief stopConversions()
// *          Transforms float into string.
// *          Better than sprintf because of memory; Faster than divisions
// * @param[in]    float * 1000;
// *
// * @return      None
// */
//void send(unsigned int x){
//    x = x; // times 1000 to get every number (3 decimals)
//    // number 1
//    unsigned char count = 0;
//    char temperature[6] = {0};
//    while(x>=10000){ // x may be 0..65535 here
//        count++;
//        x-=10000;
//    }
////    putchar (0x30+count);   // 0x30 is to transform decimal to ASCII
//    temperature[0]=count;
//    count=0;
//    // number 2
//    while(x>=1000){ // at this point, x is 9999 at max
//        count++;
//        x-=1000;
//    }
////    putchar (0x30+count);
//    // test: putchar ,
////    putchar(",");
//    count=0;
//    // number 3
//    while(x>=100){  // x is no more than 999 now
//        count++;
//        x-=100;
//    }
////    putchar (0x30+count);
//    count=0;
//    // number 4
//    while(x>=10){ // and here, x cannot be more than 99
//        count++;
//        x-=10;
//    }
////    putchar (0x30+count);
//    // number 5
////    putchar (0x30+x); // x is 0..9 at this point, everything above has been already subtracted.
//}
/************************************************************************************//**
 *
 * @brief readData()
 *          Sends the read command and retrieves STATUS (if enabled) and data
 *          NOTE: Call this function after /DRDY goes low and specify the
 *          the number of bytes to read and the starting position of data
 *
 * @param[in]   status[]    Pointer to location where STATUS byte will be stored
 * @param[in]   mode        Direct or Command read mode
 *
 * @return      32-bit sign-extended conversion result (data only)
 */
int32_t readConvertedData(uint16_t status[], readMode mode )
{
    uint16_t DataTx[RDATA_COMMAND_LENGTH + STATUS_LENGTH + DATA_LENGTH + CRC_LENGTH] = { 0 };    // Initialize all array elements to 0
    uint16_t DataRx[RDATA_COMMAND_LENGTH + STATUS_LENGTH + DATA_LENGTH + CRC_LENGTH] = { 0 };
    uint16_t byteLength;
    uint16_t dataPosition;
    uint16_t byte_options;
    bool    status_byte_enabled = 0;
    int32_t signByte, upperByte, middleByte, lowerByte;
    uint16_t i;
    // Status Byte is sent if SENDSTAT bit of SYS register is set
    byte_options = IS_SENDSTAT_SET << 1 | IS_CRC_SET;
    switch ( byte_options ) {
        case 0:                         // No STATUS and no CRC
            byteLength   = DATA_LENGTH;
            dataPosition = 0;
            break;
        case 1:                         // No STATUS and CRC
            byteLength   = DATA_LENGTH + CRC_LENGTH;
            dataPosition = 0;
            break;
        case 2:                         // STATUS and no CRC
            byteLength   = STATUS_LENGTH + DATA_LENGTH;
            dataPosition = 1;
            status_byte_enabled = 1;
            break;
        case 3:                         // STATUS and CRC
            byteLength   = STATUS_LENGTH + DATA_LENGTH + CRC_LENGTH;
            dataPosition = 1;
            status_byte_enabled = 1;
            break;
    }

    if ( mode == COMMAND ) {
        DataTx[0]     = OPCODE_RDATA;
        byteLength   += 1;
        dataPosition += 1;
    }
//    spiSendReceiveArrays( spiHdl, DataTx, DataRx, byteLength );
    for(i = 0; i < byteLength; i++){
        DataRx[i] = spi_xmit(DataTx[i]);
    }


    // Parse returned SPI data
    /* Check if STATUS byte is enabled and if we have a valid "status" memory pointer */
    if ( status_byte_enabled && status ) {
        status[0] = DataRx[dataPosition - 1];
    }

    /* Return the 32-bit sign-extended conversion result */
    if ( DataRx[dataPosition] & 0x80u ) {
        signByte = 0xFF000000;
    } else {
        signByte = 0x00000000;
    }

    upperByte   = ((int32_t) DataRx[dataPosition] & 0xFF) << 16;
    middleByte  = ((int32_t) DataRx[dataPosition + 1] & 0xFF) << 8;
    lowerByte   = ((int32_t) DataRx[dataPosition + 2] & 0xFF);

    return ( signByte + upperByte + middleByte + lowerByte );
}


void floatToChar(float fTemperature, char* sTemperature){
    int temp = (int)(fTemperature*1000);
    sTemperature[0] = (temp/10000) + '0';       // 12345 /10000 =

    sTemperature[1] = ((temp/1000) %10) + '0';       // 12345 /1000 = 12.345 %10 = 2

    sTemperature[2] = '.';
    sTemperature[3] = ((temp/100) %10)+ '0';         // 12345 /100 = 123.45 %10 = 3

    sTemperature[4]=((temp/10) %10)+ '0';            // 12345 / 10 = 1234,5 %10 = 4

    sTemperature[5]= (temp%10)+'0';                  // 12345 / 1 = 12345 %10 = 5

    }
